josright123/0722/NUC9701 - JJ0.c
 	SetMac1Addr(pEthInfo->myMacAddr) ;
	m_nP9701_Mutex = 0;
	m_pEthInfo1->portSilentTime = 0; 
	if(PHY1Chip != CHIP_DM8603)
	{
		SetIntVector((PVOID)MAC1_Tx_isr,EMC1_TX_IRQn,IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE);
		SetIntVector((PVOID)MAC1_Rx_isr,EMC1_RX_IRQn,IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE);
		Mac1_EnableInt();
		EnableInt(EINT2_IRQn);	
	}
	return 1;
}
#else	
int Mac1_Initialize(ethaddr MacAddr)
{
}
#endif
void  Mac1_ShutDown()
{
	MCMDR1 &= ~(MCMDR_RXON|MCMDR_TXON) ;
}       
int Mac1jj1=0;
int Mac1jj2 = 11;
int Mac1jj3= 21;
int Mac1jj4 = 1;
int Mac1jj5 = 0;
int Mac1cc1= 0;
int Mac1cc2= 0;
int Mac1cc3 = 0;
#if defined(TCP_SPEEDUP) && defined(NUC970)
char* MAC1_GetSendFramePt(int ori)
{
	char* TxData = NULL;
	sFrameSendBuffer* pTxDataPtr = gWTx1DataStartPtr;
	int i;
#if defined(TEST_BO)
DisplayWord(60,29,(int)Mac1jj5);
DisplayWord(30,27,Mac1jj1++);
#endif
	Mac1_DisableInt();
	for(i = 0; i < MaxTxFrameDescriptors; i++) {
		if ( (pTxDataPtr+i)->used == 0) 
		{
			(pTxDataPtr+i)->used = 1;
			(pTxDataPtr+i)->purpose = ori;
			TxData = (char*)(&(pTxDataPtr+i)->data);
Mac1jj5++;
w1frame++;
w1frame1++;
			break;
		}
	}
	Mac1_EnableInt();
#if defined(TEST_BO)
DisplayWord(35,27,Mac1jj1++);
#endif
	if (!TxData) 
	{
			for(i = 0; i < MaxTxFrameDescriptors; i++) {
				if ( (pTxDataPtr+i)->used != 0) 
				{
					(pTxDataPtr+i)->used = 0;
					(pTxDataPtr+i)->purpose = 0;
				}
			}
		(pTxDataPtr+0)->used = 1;
		(pTxDataPtr+0)->purpose = ori;
		TxData = (char*)(&(pTxDataPtr+0)->data);
	}
	return TxData;
}
int Mac1_FreeSendFramePt(char* pData, int ori)
{
	int ret = 0;
	sFrameSendBuffer* pTxDataPtr = gWTx1DataStartPtr;
	int i;
#if defined(TEST_BO)
DisplayWord(40,27,Mac1jj1++);
#endif
	if (ori !=5) 
	{
	Mac1_DisableInt();
	}
Mac1jj5--;		
w1frame1 = w1frame1 -1;
	for(i = 0; i < MaxTxFrameDescriptors; i++) {
		if ((char*)(&(pTxDataPtr+i)->data) == pData) 
		{
			(pTxDataPtr+i)->used=0;
			(pTxDataPtr+i)->purpose = 0;
			ret = 1;
w1frame = w1frame -1;	
			break;
		}
	}
	if (ori !=5) 
	{
	Mac1_EnableInt();
	}
#if defined(TEST_BO)
DisplayWord(45,27,Mac1jj1++);
#endif
	return ret;
}
int Mac1_SendPacketSpeedup(BYTE*  pbData, DWORD dwLength)
{
	sFrameDescriptor *psTxFD;
	psTxFD = (sFrameDescriptor *)gWTx1FDPtr;
	psTxFD->FrameDataPtr=(UINT32)pbData;
	psTxFD->Status2 = (UINT32)(dwLength & 0xffff);
	psTxFD->Status1 |= TXfOwnership_DMA;
	Tx1Ready = 0;
	Mac1TxGo();
	gWTx1FDPtr = (UINT32)(psTxFD->NextFrameDescriptor);
}
#endif
int MAC1_SendPacket(BYTE*  pbData, DWORD dwLength)
{
	sFrameDescriptor *psTxFD;
	UINT32         *pTXFDStatus1;
	psTxFD = (sFrameDescriptor *)gWTx1FDPtr ;
	pTXFDStatus1 = (UINT32 *)&psTxFD->Status1;
#if defined(NUC970)
	psTxFD->FrameDataPtr = (UINT32)MAC1_GetSendFramePt(5);
	m_memcpy(psTxFD->FrameDataPtr,(char*)pbData,(UINT32)(dwLength & 0xffff));
#else	
	psTxFD->FrameDataPtr=(UINT32)pbData | 0x80000000;
#endif	
	psTxFD->Status2 = (UINT32)(dwLength & 0xffff);
	psTxFD->Status1 |= TXfOwnership_DMA;
	Tx1Ready = 0;
	Mac1TxGo();
	gWTx1FDPtr = (UINT32)(psTxFD->NextFrameDescriptor);
	return 1 ;
}
int Mac1_SendPacket_InINT(BYTE*  pbData, DWORD dwLength)
{
	return 1 ;
}
int Mac1jjj = 0;
void MAC1_Tx_isr(void)
{   
	sFrameDescriptor 	*pTxFDptr;
	UINT32 			Status, RdValue;
	int in = 0;
#if defined(TEST_BO)
 _DisplayDWord(30,28,Mac1jj1++);
#endif
	RdValue = MISTA1;
	MISTA1 = RdValue&0xffff0000;
	if (RdValue & MISTA_TDU)
		TDU1_Flag = 1;
	if (RdValue & MISTA_TxBErr) {
		MCMDR1|=MCMDR_SWR;  
	} else {
		do
		{
			pTxFDptr = (sFrameDescriptor *) gCTx1FDPtr;
			Status = (pTxFDptr->Status2 >> 16) & 0xffff;
			if (Status & TXFD_TXCP) {
				Tx1Ready = 1;
				if (Status & ( TXFD_TXABT | TXFD_DEF | TXFD_PAU | TXFD_EXDEF |
						TXFD_NCS | TXFD_SQE | TXFD_LC | TXFD_TXHA) ) {
					;
				}
				pTxFDptr->Status2 = (UINT32)0x0;
				Mac1_FreeSendFramePt((char*)pTxFDptr->FrameDataPtr,5);
	       		gCTx1FDPtr = (UINT32)pTxFDptr->NextFrameDescriptor ;
			}
			else 
			{
				break;
			}
			in++;
			if (in>MaxTxFrameDescriptors)
			{
				break;
			}
		} while(gCTx1FDPtr != CTXDSA1);
	}
	MISTA1 = 0xFFFF;
#if defined(TEST_BO)
 _DisplayDWord(40,28,Mac1jj1++);
#endif
}
bool Mac1isHWConnectionOk_Simple(void)
{
	return m_pEthInfo1->portStatus;
}
#if defined(TCP_SPEEDUP) && ( defined(NUC970) || defined(W90P950) )
int Mac1_GetRxFlowControl(int rxFrameCount)
{
	return mac1_flowcontrl;
}
int Mac1_SetRxFlowControl(int rxFrameCount)
{
	int flowCtrl = mac1_flowcontrl;
	if (rxFrameCount>=mac1_flowHighThread) 
	{
		flowCtrl = 1;
	}
	else if (rxFrameCount<=mac1_flowLowThread) 
	{
		flowCtrl = 0;
	}
	else 
	{
		flowCtrl = mac1_flowcontrl;
	}
	return flowCtrl;
}
#endif
int Mac1per=0;
int MAC1_ReceivePacket( BYTE *pbData, UINT16 *pwLength,WORD* iPosition)
{
	NETBUF      *buffer;
	if (_iqueue1_first == NULL) {
#if defined(TCP_SPEEDUP) && ( defined(NUC970) || defined(W90P950) )
		mac1_rxFrameCount = 0;	
		mac1_flowcontrl = Mac1_SetRxFlowControl(mac1_rxFrameCount);
#endif
		return false;
	} else {
		Mac1_DisableInt();
		buffer = (NETBUF*)_iqueue1_first;
		_iqueue1_first = _iqueue1_first->next;
		if (_iqueue1_first == NULL)  
			_iqueue1_last = NULL;
#if defined(TCP_SPEEDUP) && ( defined(NUC970) || defined(W90P950) )
		mac1_rxFrameCount--;
		mac1_flowcontrl = Mac1_SetRxFlowControl(mac1_rxFrameCount);
#endif	
		Mac1_EnableInt();
		*pwLength = buffer->len;
		PutInTskQueue(buffer->packet, *pwLength,iPosition, m_pEthInfo1->portSeq); 
			if (*iPosition == PACKET_WILL_DISCARD || *iPosition == PACKET_WILL_FORWARD) 
			{
				return false;
			}
			else if (*iPosition == PACKET_UNDECIDED_YET) {
	#if defined(NUC970)
				m_memcpy(pbData, buffer->packet, *pwLength);
	#else
				memcpy(pbData, buffer->packet, *pwLength);
	#endif
				return true;
			}
			else 
			{
				return true;
			}
		return true;	   
	}   
}
void MAC1_Rx_isr(void)
{
	sFrameDescriptor 	*pRxFDptr ;
	UINT32 				RxStatus ;
	UINT32 				CRxPtr;
	UINT32 				RdValue;
	int ret;
int i=0;
	RdValue = MISTA1;
	MISTA1 = RdValue&0x0000ffff;
#if defined(TEST_BO)
_DisplayDWord(30,26,Mac1jj1++);
#endif
 	if (RdValue & MISTA_RxBErr)  {
		MCMDR1|=MCMDR_SWR;  
	} else {
		if (RdValue & (MISTA_CFR | MISTA_CRCE | MISTA_PTLE | MISTA_ALIE | MISTA_RP)) {
		} else {
			CRxPtr = CRXDSA1 ;
			do {
				pRxFDptr = (sFrameDescriptor *)gCRx1FDPtr;
				if ((pRxFDptr->Status1|RXfOwnership_CPU)==RXfOwnership_CPU) {
					RxStatus = (pRxFDptr->Status1 >> 16) & 0xffff;
					if (RxStatus & RXFD_RXGD)  {
						ret = 0;
						if (ret==0) {
							if (_iqueue1_last == NULL) {
								_iqueue1_last = (NETBUF *)pRxFDptr->FrameDataPtr;
								_iqueue1_first = _iqueue1_last;
							} else {
								_iqueue1_last->next = (NETBUF *)pRxFDptr->FrameDataPtr;
								_iqueue1_last = _iqueue1_last->next;
							}
							_iqueue1_last->len = pRxFDptr->Status1 & 0xffff;
							_iqueue1_last->next = NULL;             
						}
					} else {
					}
       			} else {
					break;
				}
				pRxFDptr->Status1 = RXfOwnership_DMA;
				gCRx1FDPtr = (UINT32)(pRxFDptr->NextFrameDescriptor) ;
#if defined(TCP_SPEEDUP) && ( defined(NUC970) || defined(W90P950) )
				mac1_rxFrameCount++;
#endif
			} while (CRxPtr != gCRx1FDPtr);
		}
		if (RdValue & MISTA_RDU)
			RSDR1 = 0;
	}
	if ((m_pEthInfo1->portStatus&ETH_PORT_STATUS_OK) == ETH_PORT_STATUS_OK)
	{
		m_pEthInfo1->portSilentTime = 0; 
	}
#if defined(TEST_BO)
_DisplayDWord(40,26,Mac1jj1++);
#endif
}
void Check_PHY1_INT_CNTL_REG(void)
{
	UINT32	RdValue;
#if defined(VIRTUAL_NIC_SUPPORT)
	NET_ADAPTER_INFO *pVirAdapter = NULL;
	if (m_pEthInfo1->virtualPortSeq >= 1 && m_pEthInfo1->virtualPortSeq <= ETH_GetEthPortsOnHmi()) 
	{
		pVirAdapter = (NET_ADAPTER_INFO *)ETH_GetAdapterFrmPort(m_pEthInfo1->virtualPortSeq);
	}
	else 
	{
		pVirAdapter = NULL;
	}
#endif
	if(PHY1Chip == CHIP_KSZ8081)
	{
		RdValue = Mii1StationRead(PHY_INT_CNTL_REG, PHY1AD) ;
		if (RdValue&1)
		{
			m_pEthInfo1->bUseInt = 1;		
			if ((m_pEthInfo1->portStatus&ETH_PORT_STATUS_CABLE_LINKED) != ETH_PORT_STATUS_CABLE_LINKED) 
			{
		 		m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus | ETH_PORT_STATUS_CABLE_LINKED );
				m_pEthInfo1->dealMsg = 1;
				m_pEthInfo1->internalStatus = 0;	
				m_pEthInfo1->portSilentTime =0;
	#if defined(VIRTUAL_NIC_SUPPORT)
				if (pVirAdapter) 
				{
					pVirAdapter->portStatus = m_pEthInfo1->portStatus;
				}
	#endif
			}
		}
		else if (RdValue&4) 
		{
			if ((m_pEthInfo1->portStatus&ETH_PORT_STATUS_CABLE_LINKED) == ETH_PORT_STATUS_CABLE_LINKED) 
			{
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_PROT_GETIPED);
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_NIGOTIATION_OK);
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_CABLE_LINKED);
				m_pEthInfo1->dealMsg = 1;
				m_pEthInfo1->internalStatus = 0;	
				m_pEthInfo1->portSilentTime =0;
	#if defined(VIRTUAL_NIC_SUPPORT)
				if (pVirAdapter) 
				{
					pVirAdapter->portStatus = m_pEthInfo1->portStatus;
				}
	#endif
			}
		}
		else if (RdValue&8) 
		{
		}
		else if (RdValue&0x80) 
		{
		}
   	}
   	else if(PHY1Chip == CHIP_YT8512C)
   	{
   		RdValue = Mii1StationRead(YT8512_PHY_INT_STATUS_REG, PHY1AD);
		if (RdValue & LINK_SUCCEED_INT)
		{
			m_pEthInfo1->bUseInt = 1;		
			if ((m_pEthInfo1->portStatus&ETH_PORT_STATUS_CABLE_LINKED) != ETH_PORT_STATUS_CABLE_LINKED) 
			{
		 		m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus | ETH_PORT_STATUS_CABLE_LINKED );
				m_pEthInfo1->dealMsg = 1;
				m_pEthInfo1->internalStatus = 0;	
				m_pEthInfo1->portSilentTime =0;
	#if defined(VIRTUAL_NIC_SUPPORT)
				if (pVirAdapter) 
				{
					pVirAdapter->portStatus = m_pEthInfo1->portStatus;
				}
	#endif
			}
		}
		else if (RdValue & LINK_FAILED_INT) 
		{
			if ((m_pEthInfo1->portStatus&ETH_PORT_STATUS_CABLE_LINKED) == ETH_PORT_STATUS_CABLE_LINKED) 
			{
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_PROT_GETIPED);
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_NIGOTIATION_OK);
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_CABLE_LINKED);
				m_pEthInfo1->dealMsg = 1;
				m_pEthInfo1->internalStatus = 0;	
				m_pEthInfo1->portSilentTime =0;
	#if defined(VIRTUAL_NIC_SUPPORT)
				if (pVirAdapter) 
				{
					pVirAdapter->portStatus = m_pEthInfo1->portStatus;
				}
	#endif
			}
		}
   	}
	else if(PHY1Chip == CHIP_IP101A_INT)
	{
		RdValue = Mii1StationRead(IP101_PHY_INT_CNTL_REG, PHYAD);	
	   	RdValue = Mii1StationRead(IP101_PHY_INT_STATUS_REG, PHYAD);
	   	Disp("IP101 INT RdValue =%xH \n",RdValue);
	   	if((RdValue & LINK_SUCCEED_INT) == LINK_SUCCEED_INT)
		{
			m_pEthInfo1->bUseInt = 1;		
			if ((m_pEthInfo1->portStatus&ETH_PORT_STATUS_CABLE_LINKED) != ETH_PORT_STATUS_CABLE_LINKED) 
			{
		 		m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus | ETH_PORT_STATUS_CABLE_LINKED );
				m_pEthInfo1->dealMsg = 1;
				m_pEthInfo1->internalStatus = 0;	
				m_pEthInfo1->portSilentTime =0;
	#if defined(VIRTUAL_NIC_SUPPORT)
				if (pVirAdapter) 
				{
					pVirAdapter->portStatus = m_pEthInfo1->portStatus;
				}
	#endif
			}
		}
		else if( (RdValue & LINK_SUCCEED_INT) != LINK_SUCCEED_INT)	
		{
			if ((m_pEthInfo1->portStatus&ETH_PORT_STATUS_CABLE_LINKED) == ETH_PORT_STATUS_CABLE_LINKED) 
			{
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_PROT_GETIPED);
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_NIGOTIATION_OK);
				m_pEthInfo1->portStatus = (m_pEthInfo1->portStatus & ~ETH_PORT_STATUS_CABLE_LINKED);
				m_pEthInfo1->dealMsg = 1;
				m_pEthInfo1->internalStatus = 0;	
				m_pEthInfo1->portSilentTime =0;
	#if defined(VIRTUAL_NIC_SUPPORT)
				if (pVirAdapter) 
				{
					pVirAdapter->portStatus = m_pEthInfo1->portStatus;
				}
	#endif
			}
		}   	
	}
}
void GPIO_IRQHandler2(void)
{
    UINT32 reg;
    INT32 mask;
    reg = inpw(REG_AIC_ISR);
    mask = 0x40;
    Check_PHY1_INT_CNTL_REG();
    outpw(REG_GPIOF_ISR, (1<<13));	
    outpw(REG_AIC_SCCR, mask);   
}
#endif
